Revit 2027 API
FabricSheetType.MajorLapSpliceLength Property
 The lap splice length in the major direction.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double MajorLapSpliceLength { get; set; }
Public Property MajorLapSpliceLength As Double
	Get
	Set
public:
property double MajorLapSpliceLength {
	double get ();
	void set (double value);
}
member MajorLapSpliceLength : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: majorLapSpliceLength is greater than the half of the overall length.
See Also
Reference
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace